---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintRadius
source: html/586a2545-9e5d-ee58-bebc-1bfd4c5881e0.htm
---
# RebarShapeConstraintRadius Methods

Return the Id of the parameter associated with this constraint.